Revit 2027 API
ElectricalSystem.PowerFactorState Property
 The PowerFactorState type of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PowerFactorStateType PowerFactorState { get; }
Public ReadOnly Property PowerFactorState As PowerFactorStateType
	Get
public:
property PowerFactorStateType PowerFactorState {
	PowerFactorStateType get ();
}
member PowerFactorState : PowerFactorStateType with get
Property Value
PowerFactorStateType
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the PowerFactorState type of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace